<template>
  <common-dialog v-bind="$attrs" @input="close">
    <h3 class="text-center text-brandPrimary-main pb-6 text-h5">
      قوانین و مقررات مرتبط با اعتبارسنجی
    </h3>
    <div class="my-10 m-auto px-6 lh-32 text-justify">
      <p><b>کاربر گرامی لطفاً موارد زیر را جهت استفاده بهینه از خدمات این سامانه به دقت ملاحظه فرمایید. هرگونه استفاده از این سامانه به معنی آگاهی و پذیرش تمامی شروط مندرج در این شرایط نامه است. توجه داشته باشید که ثبت درخواست نیز در هر زمان به معنی پذیرفتن کامل تمام شرایط و قوانین این سامانه از سوی کاربر است</b></p><p class="space-y-4">
        <b class="text-brandPrimary-main pb-4">صحت اطلاعات گزارش اعتباری</b>
      </p><p>اطلاعات ذکر شده در گزارش اعتباری تماماً توسط شرکت مشاوره رتبه&zwnj;بندی اعتباری ایران و بر اساس داده&zwnj;های موجود در بانک&zwnj;های کشور می&zwnj;باشد. لذا در زمینه صحت اطلاعات، مسئولیتی متوجه سامانه نمی&zwnj;باشد. با این وجود این موارد به معنی صحت صد در صدی گزارش اعتباری شما نیست.</p></p><p>در صورتی که تصور می&zwnj;کنید در گزارش شما خطایی وجود دارد می&zwnj;توانید از طریق این سامانه و یا از طریق تماس با واحد پشتیبانی به شماره تلفن 87700500 (021) به محتوای گزارش خود اعتراض نمایید. در واقع وظیفه کنترل گزارش اعتباری به عهده اشخاص بوده و شخص صاحب گزارش باید با اخذ گزارش اعتباری از بسترهای موجود، از صحت اطلاعات منعکس شده در آن اطمینان حاصل نمایند. بدیهی است در صورت وجود هرگونه نقص در اطلاعات گزارش اعتباری، وظیفه ارائه اعتراض و پیگیری آن به عهده اشخاص می&zwnj;باشد.</p><p>اشخاص مکلفند اعتراض خود به گزارش اعتباری را ظرف حداکثر یک ماه پس از تاریخ دریافت گزارش، با ارائه شماره یکتای گزارش مذکور در این سامانه ثبت نمایند.</p><p>توجه: اشخاص تنها می&zwnj;توانند نسبت به اطلاعات گزارش اعتباری، اعتراض خود را ثبت نمایند. همچنین در صورتی که اشخاص مبادرت به پرداخت مبالغ غیرجاری تسهیلات و رفع سوء اثر چک برگشتی نموده&zwnj;اند، حداقل زمان مورد نیاز برای به&zwnj;روزرسانی اطلاعات مذکور 10 روز کاری از تاریخ اقدام می&zwnj;باشد و به اعتراضات ارائه شده در بازه مذکور رسیدگی نمی&zwnj;شود.</p><p class="space-y-4">
        <b class="text-brandPrimary-main pb-4">اطلاعات موجود در گزارش اعتباری</b>
      </p><p>توجه: پاسخ استعلام از سامانه اعتبارسنجی در مورد هر مشتری بنابر اینکه در پنج سال گذشته تاکنون از بانکهای عضو سامانه تسهیلات دریافت نموده باشد یا هيچ&zwnj;گونه تسهیلاتی دریافت نکرده باشد، به دو صورت خواهد بود: در صورت نداشتن هيچ&zwnj;گونه تسهيلات یا قرارداد: صرفاً گزارش آمار استعلام (گزارش خالی) در مورد این مشتری در سامانه توليد شده و در اختیار کاربر قرار می&zwnj;گیرد. در صورت دارا بودن تسهيلات یا قرارداد (دارا بودن حداقل یک قرارداد): گزارش اعتبارسنجی شامل اطلاعات مدنظر در اختیار کاربر قرار می&zwnj;گيرد. در صورت دارا بودن تسهیلات یا قرارداد جاری رتبه و امتیاز اعتبارسنجی در اختیار کاربر قرار می&zwnj;گيرد</p></p></p><p class="space-y-4">
        <b class="text-brandPrimary-main pb-4">حفظ محرمانگی اطلاعات</b>
      </p><p>گزارش اعتباری شما فقط در اختیار شما قرار می گیرد و هیچ شخص دیگری حق دسترسی به این گزارش را نخواهد داشت، مگر آنکه خود کاربر دسترسی مشاهده گزارش خود را به کاربر دیگری ارائه کند.</p><p>در هنگام درخواست گزارش اعتباری می بایست از خط تلفن همراهی استفاده کنید که متعلق به خودتان است. به این معنی که کد ملی و شماره تلفن همراه آن در شبکه تلفن همراه مطابقت داشته باشد و سند تلفن همراه به نام متقاضی دریافت کننده گزارش باشد. در غیر اینصورت گزارش اعتباری به کاربر نمایش داده نخواهد شد و مسئولیت تمام عواقب آن به عهده کاربر می باشد. لذا در این زمینه دقت لازم را به عمل آورید.</p></p></p><p class="space-y-4">
        <b class="text-brandPrimary-main pb-4">کارمزد و هزینه</b>
      </p><p>کارمزد و هزینه سرویس های ارائه شده به مشتری طبق قوانین تصویب شده می باشد و این سامانه در روند قیمت گذاری دخالتی ندارد که قیمت آن در زمان پرداخت به صورت شفاف به کاربر اعلام می&zwnj;گردد.</p></p></p><p class="space-y-4">
        <b class="text-brandPrimary-main pb-4">سایر موارد</b>
      </p><p>لازم به ذکر است این سامانه حق به روز رسانی این سند را (که بدون هیچ محدودیتی شامل تغییر یا حذف قوانین) در هر زمان و بدون اطلاع کاربر خواهد داشت. چنین تغییر و یا حذفی از زمان انتشار نسخه به روز شده این سند در وب&zwnj;سایت رسمی سامانه به صورت قانونی شامل حال تمام کاربران خواهد شد و این کاملا به عهده کاربر است که از آخرین نسخه به روز شده این سند مطلع باشد.</p></p></p>
    </div>
    <div class="d-flex align-center pa-4">
      <!-- <v-btn
        outlined
        color="primary darken-2"
        class="rounded-lg"
        style="border-width: 2px !important;"
        width="75%"
        height="46px"
      >
        مشاهده اطلاعات بیشتر
      </v-btn> -->
      <v-spacer />
      <v-btn class="flex-1" text width="20%" @click="close(false)">
        بستن
      </v-btn>
    </div>
  </common-dialog>
</template>
<script>
export default {
  methods: {
    close (value) {
      this.$emit('input', value)
    }
  }
}
</script>
<style></style>
